import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root',
})
export class PlaneService {
  constructor() {}
  faqs = [
    {
      question:
        'بعد از خرید آنلاین بلیط هواپیما چطور می‌توانم بلیطم را دریافت کنم؟',
      answer:
        'بعد از کامل‌کردن اطلاعات مسافرها و پرداخت آنلاین مبلغ بلیط، لینک دانلود بلیط از طریق پیامک و ایمیل برای شما ارسال می‌شود. با ورود به این لینک می‌توانید بلیطتان را دانلود کنید. همچنین می‌توانید با مراجعه به صفحه پیگیری خرید و با وارد‌کردن شماره موبایل و کد پیگیری بلیطتان را دانلود کنید.',
    },
    {
      question: ' آیا در هنگام خرید آنلاین به چاپ بلیط هواپیما نیاز است؟',
      answer:
        '      هنگام خرید بلیط سیستمی آنلاین نیازی به چاپ بلیط هواپیما ندارید. همراه داشتن عکس بلیط در تلفن همراهتان کافی است. اما برای بلیط‌های چارتری با توجه به اینکه در صورت کنسلی پرواز، نیاز به مهر شدن بلیط در فرودگاه پیدا می‌کنید، بهتر است بلیط چاپ شده را به همراه داشته باشید.   ',
    },
    {
      question: '      جریمه کنسلی بلیط هواپیما چطور محاسبه می‌شود؟ ',
      answer:
        'جریمه کنسلی بلیط هواپیما به عوامل مختلفی بستگی دارد. اگر بلیط شما امکان کنسل‌کردن داشته باشد، بسته به شرکت هواپیمایی و ساعتی که برای استرداد بلیط هواپیما اقدام می‌کنید درصد جریمه متفاوت خواهد بود. هنگام رزرو بلیط هواپیما در قسمت قوانین کنسلی میزان جریمه کنسل‌کردن پرواز در زمان‌های مختلف نوشته شده‌است. همچنین برای مشاهده درصد جریمه کنسلی بلیط‌ها می‌توانید به صفحه قوانین و مقررات مراجعه کنید.',
    },
    {
      question: '      دلیل تفاوت قیمت بلیط هواپیما در یک مسیر چیست؟  ',
      answer:
        '      عوامل مختلفی بر قیمت بلیط پرواز تأثیر می‌گذارد، مثلاً اگر یک مسیر پرواز داخلی را در نظر بگیرید عواملی مثل شرکت هواپیمایی و کلاس پروازی بر قیمت بلیط تأثیر می‌گذارند. همچنین در پروازهای چارتری زمان باقیمانده تا پرواز از عوامل تأثیرگذار بر قیمت بلیط است. ',
    },
    {
      question: '      چگونه می‌توانم بلیط هواپیما ارزان بخرم؟  ',
      answer:
        '      تقویم مشاهده قیمت روزهای دیگر که قیمت همان بلیط در چند روز آینده را نشان می‌دهد و روزی که پایینترین قیمت را دارد مشخص شده، مرتب‌سازی بر اساس کمترین قیمت، فیلتر بر اساس بازه قیمتی، فیلتر نوع پرواز سیستمی و چارتری، امکاناتی هستند که اسنپ‌تریپ در نظر گرفته شده تا بتوانید به راحتی با استفاده از فیلترها ارزانترین بلیط هواپیما را در اسنپ‌تریپ بخرید. ',
    },
    {
      question:
        '      چطور می‌توانم ارزان‌ترین بلیط هواپیما را در اسنپ‌تریپ خریداری کنم؟   ',
      answer:
        'بعد از کامل‌کردن اطلاعات مسافرها و پرداخت آنلاین مبلغ بلیط، لینک دانلود بلیط از طریق پیامک و ایمیل برای شما ارسال می‌شود. با ورود به این لینک می‌توانید بلیطتان را دانلود کنید. همچنین می‌توانید با مراجعه به صفحه پیگیری خرید و با وارد‌کردن شماره موبایل و کد پیگیری بلیطتان را دانلود کنید.',
    },
    {
      question: '      تفاوت بلیط‌های چارتری و سیستمی در چیست؟     ',
      answer:
        '      این سوال برای خیلی از کسانی که برای اولین‌بار به خرید بلیط هواپیما اقدام می‌کنند پیش می‌آید. بلیط‌های چارتری بلیط‌هایی هستند که یک شرکت یا آژانس چند صندلی را یک‌جا از شرکت هواپیمایی خریده است و با قیمت خودش می‌فروشد. بنابراین قیمت این پروازها در موقعیت‌های مختلف متغیر است و بسته به نزدیک‌شدن به تاریخ سفر و عوامل دیگر تغییر می‌کند. اغلب به کسانی که به‌دنبال خرید بلیط ارزان هواپیما هستند پیشنهاد می‌کنند که پروازهای چارتری لحظه آخری را انتخاب کنند، اما واقعیت این است که خرید بلیط چارتری در لحظه آخر برای کسانی که حتماً قصد سفر دارند روش مطمئنی نیست، زیرا در روزهای پرمسافر هر لحظه ممکن است ظرفیت پرواز موردنظرشان پر شود.پروازهای چارتری نسبت به پروازهای سیستمی شرایط کنسلی متفاوتی دارند و نرخ بلیط کودک و بزرگسال در این پروازها یکسان است. پروازهای سیستمی با قیمت مصوب شرکت هواپیمایی ارائه می‌شود. این بلیط‌ها را می‌توانید بسته به شرایط و قوانین شرکت‌ هواپیمایی در بازه‌های زمانی مشخصی قبل از پرواز تغییر دهید یا کنسل کنید.    ',
    },
    {
      question: '      تفاوت کلاس‌های پروازی مختلف در چیست؟   ',
      answer:
        '         پروازها سه کلاس مختلف دارند؛ پروازهای درجه یک ‌(First Class)، پروازهای تجاری (Business)، پروازهای اقتصادی (Economy). امکانات و خدمات کلاس‌های پروازی بسته به شرکت‌ هواپیمایی متفاوت است، اما معمولاً مسافرهای پروازهای درجه یک فضایی خصوصی در اختیار دارند، صندلی‌هایشان راحت‌تر است و می‌توانند از امکاناتی مانند تلویزیون و لپ‌تاپ و منوی غذا و … استفاده کنند. مسافرهایی که بلیط درجه یک دارند دیرتر از مسافرهای دیگر سوار هواپیما می‌شوند و زودتر از دیگران پیاده می‌شوند. به تبع قیمت بلیط‌های درجه یک از کلاس‌های پروازی دیگر بیشتر است.مسافرهای پروازهای تجاری ردیف‌های جلوی هواپیما می‌نشینند و صندلی‌های راحت‌تری دارند و از منو می‌توانند غذای موردنظرشان را انتخاب کنند. این مسافرها در سوار و پیاده‌شدن نسبت به مسافرهای دیگر حق تقدم دارند.مسافرهایی که هنگام خرید بلیط هواپیما کلاس اقتصادی را انتخاب می‌کنند هزینه کمتری برای بلیط‌شان می‌پردازند و البته از امکاناتی مثل کلاس درجه یک و تجاری بهره نمی‌برند. ',
    },
  ];
  getAllfaqs() {
    return this.faqs;
  }
}
